In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# 1.타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [12]:
# 2.sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존 인원수를 출력하시오.
titanic['sex'].sort_values()
titanic['age'].sort_values()
titanic['class'].sort_values()
titanic['alive'].sort_values()

0       no
519     no
521     no
522     no
524     no
      ...
546    yes
215    yes
216    yes
218    yes
445    yes
Name: alive, Length: 891, dtype: object

In [13]:
# 3.타이타닉호 승객의 평균 나이를 구하라.
titanic['age'].mean()

29.69911764705882

In [16]:
# 4.타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic['sex']=='female']['age'].mean()

27.915708812260537

In [32]:
# 5.타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic_f=titanic[titanic['sex']=='female']
titanic_f
titanic_f[titanic['pclass']==1]['age'].mean()
titanic[titanic['sex']=='female'][titanic['pclass']==1]['age'].mean()

C:\Users\OH\AppData\Local\Temp\ipykernel_13416\3230791923.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titanic_f[titanic['pclass']==1]['age'].mean()
C:\Users\OH\AppData\Local\Temp\ipykernel_13416\3230791923.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titanic[titanic['sex']=='female'][titanic['pclass']==1]['age'].mean()

34.61176470588235

In [57]:
# 6.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
# - 20살이 넘으면 성별을 그대로 사용한다.
# - 20살 미만이면 성별에 관계없이 “child”라고 한다.
def category1(x):
    if x > 20:
        return x
    elif x < 20:
        return 'child'
category1=titanic['age'].apply(category1)
category1

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
       ...
886     27.0
887    child
888     None
889     26.0
890     32.0
Name: age, Length: 891, dtype: object

In [41]:
# 7.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
titanic['age'].fillna(titanic['age'].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

In [75]:
# 8. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
# - 성별을 나타내는 문자열 male 또는 female로 시작한다.
# - 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
age_without_na=titanic['age'].fillna(0)
string_int_age=age_without_na.astype(int).astype(str)
category2=titanic['sex']+string_int_age
category2

0        male22
1      female38
2      female26
3      female35
4        male35
         ...
886      male27
887    female19
888     female0
889      male26
890      male32
Length: 891, dtype: object

In [54]:
# 9.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
# 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.
age_cate=pd.cut(titanic['age'],bins,labels).value_counts()
titanic['age'].count()
age_rate.sum()
age_rate=age_cate/714
age_rate

age
(30, 50]     0.337535
(20, 30]     0.322129
(1, 20]      0.231092
(50, 70]     0.082633
(70, 100]    0.007003
Name: count, dtype: float64

In [131]:
# 10. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
# - 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
# - 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.
cate4 = titanic['age']
cate4 = pd.cut(cate4, bins, labels=labels, right=False)
titanic['category3'] = cate4
titanic
def sex(x):
    if x == 'male':
        return '남자'
    else:
        return '여자'
    
def age_sex1(x):
    if x != '미성년자':
        return x+titanic['sex'].apply(sex)
    else:
        return '미성년자'
korean_sex=titanic['sex'].apply(sex)
korean_sex
titanic['korean_sex']=korean_sex
cate5=titanic['category3'].replace(np.nan,'not')
cate5

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888     NaN
889      청년
890      중년
Name: category3, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']